Squares_on_torus/NotesOnSquarePacking.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>NotesOnSquarePacking</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-07-08 00:57:51 EDT"/>
<meta name="author" content="Don Blair"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">NotesOnSquarePacking</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Notes on the Squares on the Torus literature </a>
<ul>
<li><a href="#sec-1.1">1.1 Density of Sum of Squares </a></li>
<li><a href="#sec-1.2">1.2 Packing Squares on the Torus is NP Hard </a></li>
<li><a href="#sec-1.3">1.3 Packing Squares in Squares </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Notes on the Squares on the Torus literature </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Density of Sum of Squares </h3>
<div class="outline-text-3" id="text-1.1">

<ul>
<li>
Presentation re: density of sum of squares: <a href="http://www.math.uiuc.edu/~pppollac/3talk-CNTA.pdf">http://www.math.uiuc.edu/~pppollac/3talk-CNTA.pdf</a>
</li>
<li>
Density of sum of squares via central limit theorem: <a href="http://www.sjsu.edu/faculty/watkins/CLText.htm">http://www.sjsu.edu/faculty/watkins/CLText.htm</a>
</li>
<li>
Mathworld / Wolfram article on Landau-Ramanujan Constant: <a href="http://mathworld.wolfram.com/Landau-RamanujanConstant.html">http://mathworld.wolfram.com/Landau-RamanujanConstant.html</a>
</li>
<li>
Online discussion re: density of sum of squares: <a href="http://www.math.niu.edu/~rusin/known-math/93_back/2squares">http://www.math.niu.edu/~rusin/known-math/93_back/2squares</a>
<ul>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Packing Squares on the Torus is NP Hard </h3>
<div class="outline-text-3" id="text-1.2">

<ul>
<li>
MAIN REFERENCE:  "Packing Squares into a Square", Leung, Tam, Young, Chin &ndash; Journal of Parallel and Distributed Computing 10, pp 271-275, 1990 &ndash; NOT ONLINE?!
</li>
<li>
"Packing 2x2 unit squares into grid polygons is NP Complete" <a href="http://cccg.ca/proceedings/2009/cccg09_09.pdf">http://cccg.ca/proceedings/2009/cccg09_09.pdf</a>
</li>
<li>
The Open Problems Project: Packing Unit Squares in a Simple Polygon: <a href="http://maven.smith.edu/~orourke/TOPP/P56.html">http://maven.smith.edu/~orourke/TOPP/P56.html</a>
</li>
<li>
Worse-case analysis of fast heuristics of packings squares into a square: <a href="http://www.sciencedirect.com/science/article/pii/0304397595001840">http://www.sciencedirect.com/science/article/pii/0304397595001840</a>
</li>
<li>
Master's thesis on treemaps (includes discussion of proof of NP-completeness of square packing problem) <a href="http://www.mpi-inf.mpg.de/~vdweele/download/treemaps.pdf">http://www.mpi-inf.mpg.de/~vdweele/download/treemaps.pdf</a>
</li>
<li>
Circle Packing for Origami Design is hard <a href="http://erikdemaine.org/papers/DiskPacking_Origami5/paper.pdf">http://erikdemaine.org/papers/DiskPacking_Origami5/paper.pdf</a>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Packing Squares in Squares </h3>
<div class="outline-text-3" id="text-1.3">

<ul>
<li>
"On Packing Squares into a Rectangle" <a href="http://www.or.uni-bonn.de/~hougardy/paper/SquarePacking.pdf">http://www.or.uni-bonn.de/~hougardy/paper/SquarePacking.pdf</a>
</li>
<li>
"Optimal Rectangle Packing: New Results" <a href="http://citeseer.ist.psu.edu/viewdoc/download;jsessionid=D0495E1AF4C7540BA5338A5458373144?doi=10.1.1.140.200&amp;rep=rep1&amp;type=pdf">http://citeseer.ist.psu.edu/viewdoc/download;jsessionid=D0495E1AF4C7540BA5338A5458373144?doi=10.1.1.140.200&amp;rep=rep1&amp;type=pdf</a>
</li>
<li>
Joseph Malkevitch on Geometric Packing: <a href="http://www.york.cuny.edu/~malk/tidbits/tidbit-geometric-packing.html">http://www.york.cuny.edu/~malk/tidbits/tidbit-geometric-packing.html</a>

</li>
</ul>

<p>[Include math papers found thus far, here]
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Don Blair
<a href="mailto:dwblair@outtahere">&lt;dwblair@outtahere&gt;</a>
</p>
<p class="date"> Date: 2011-07-08 00:57:51 EDT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
